Библиотека_электронных_документов_демо/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <registerRecords>AccumulationRegister._ДемоТоварыНаСкладах</registerRecords>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсправленияИсходногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсправляемогоКорректировочногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсходногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТранспортнойНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЭД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГосКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсправленияИсходногоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсправляемогоКорректировочногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортнойНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОблагаетсяНДСУПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОТранспортировкеИГрузе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДСДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкцизаДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>29</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека_электронных_документов_демо/src/Enums/ВидыДокументов/ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументов</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>СчетФактураНаАванс</name>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяНаВозврат</name>
  </enumValues>
</mdclass:Enum>

Библиотека_электронных_документов_демо/src/Enums/ВидыОпераций/ВидыОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОпераций</name>
  <enumValues>
    <name>Исправление</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
</mdclass:Enum>

Библиотека_электронных_документов_демо/src/Documents/ПоступлениеТоваровУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
&НаКлиенте
Перем ПроверкаКонтрагентовПараметрыОбработчикаОжидания Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;
// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереДокумент(ЭтотОбъект, Параметры);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ПриОткрытииДокумент(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереДокумент(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СформироватьЗаголовокФормы();
	
	УстановитьСтатусДокумента();
	
	УстановитьВидимостьПолейДоКорректировки();
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// Подсистема ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
	ПараметрыОповещения.Форма = ЭтотОбъект;
	ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
	ПараметрыОповещения.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	Если ИмяСобытия = "ОбновитьДокументИБПослеЗаполнения" 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Объект.Дата);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Элемент);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ОблагаетсяНДСУПокупателяПриИзменении(Элемент)
	
	УстановитьВидимостьПолейНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСКонтрагентамиКлиент.ОткрытьДеревоЭД(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	КлиентЭДОКлиент.СопоставитьНоменклатуруПоставщика(Элементы.Товары.ТекущиеДанные, ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Оповещение = Новый ОписаниеОповещения("РазрешитьРедактированиеРеквизитовОбъектаПослеВопроса", ЭтотОбъект);
	КлиентЭДОКлиент.ПоказатьВопросОРазрешенииРедактированияРеквизитовОбъекта(Оповещение, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Если Объект.ВидДокумента = Перечисления.ВидыДокументов.ТоварнаяНакладная Тогда
		ПодготовитьФормуТоварнаяНакладная();
		
	ИначеЕсли Объект.ВидДокумента = Перечисления.ВидыДокументов.АктВыполненныхРабот Тогда
		ПодготовитьФормуАктВыполненныхРабот();
		
	ИначеЕсли Объект.ВидДокумента = Перечисления.ВидыДокументов.АктНаПередачуПрав Тогда
		ПодготовитьФормуАктНаПередачуПрав();
		
	ИначеЕсли Объект.ВидДокумента = Перечисления.ВидыДокументов.НакладнаяНаВозврат Тогда
		ПодготовитьФормуНакладнаяНаВозврат();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуТоварнаяНакладная()
	
	ПодготовитьФормуДокумента();
	
	УстановитьВидимостьПолейНДС();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуАктВыполненныхРабот()
	
	ПодготовитьФормуДокумента();
	
	Элементы.СтраницаТовары.Заголовок = НСтр("ru = 'Услуги'");
	Элементы.ТоварыГруппаСуммаАкциза.Видимость    = Ложь;
	Элементы.ТоварыНомерГТД.Видимость             = Ложь;
	Элементы.ТоварыСтранаПроисхождения.Видимость  = Ложь;
	Элементы.СтраницаСведенияОПолучении.Видимость = Ложь;
	Элементы.ОблагаетсяНДСУПокупателя.Видимость   = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуАктНаПередачуПрав()
	
	ПодготовитьФормуАктВыполненныхРабот();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНакладнаяНаВозврат()
	
	ПодготовитьФормуДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуДокумента()
	
	СформироватьЗаголовокФормы();
	
	УстановитьСтатусДокумента();
	
	УстановитьВидимостьПолейДоКорректировки();
	
	УстановитьВозможностьРедактированияРеквизитов(ЭтотОбъект, Ложь);
	
	Если НЕ ПравоДоступа("Изменение", Объект.Ссылка.Метаданные()) Тогда
		Элементы.РазрешитьРедактированиеРеквизитовОбъекта.Видимость = Ложь;
	КонецЕсли;
	
	СчетФактура = Документы.СчетФактураПолученный.СчетФактураДокумента(Объект.Ссылка);
	УстановитьПредставлениеСчетаФактуры(ЭтотОбъект);
	
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.Реализация Тогда
		Элементы.ГруппаОснование.Видимость = Ложь;
		Элементы.ГруппаНомерИсправления.Видимость = Ложь;
		Элементы.ГруппаНомерДатаИсходногоДокумента.Видимость = Ложь;
		Элементы.ГруппаНомерДатаИсправленияИсходногоДокумента.Видимость = Ложь;
		Элементы.ГруппаНомерДатаИсправляемогоКорректировочногоДокумента.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.Исправление Тогда
		УстановитьПредставлениеДокументаОснования();
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.Корректировка Тогда
		Элементы.ГруппаНомерИсправления.Видимость = Ложь;
		Элементы.СтраницаСведенияОПолучении.Видимость = Ложь;
		Элементы.ГруппаНомерДатаИсправляемогоКорректировочногоДокумента.Видимость = Ложь;
		УстановитьПредставлениеДокументаОснования();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокФормы()
	
	ЭтотОбъект.Заголовок = КлиентЭДОКлиентСервер.ПредставлениеВходящегоДокумента(Объект, Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусДокумента()
	
	СтатусДокумента = КлиентЭДО.СтатусДокумента(Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСчетаФактуры(Форма)
	
	Если ЗначениеЗаполнено(Форма.СчетФактура) Тогда
		Форма.СчетФактураПредставление = Новый ФорматированнаяСтрока(
			Строка(Форма.СчетФактура),,,,ПолучитьНавигационнуюСсылку(Форма.СчетФактура));
	Иначе
		Форма.Элементы.СчетФактураПредставление.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеДокументаОснования()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		ДокументОснованиеПредставление = Новый ФорматированнаяСтрока(
			Строка(Объект.ДокументОснование), ,
			ЦветаСтиля.ГиперссылкаЦвет, ,
			ПолучитьНавигационнуюСсылку(Объект.ДокументОснование));
		
	ИначеЕсли Объект.ВидОперации <> Перечисления.ВидыОпераций.Реализация Тогда
		
		ПредставлениеОснования = "";
		
		Если ЗначениеЗаполнено(Объект.НомерИсправляемогоКорректировочногоДокумента)
			И ЗначениеЗаполнено(Объект.ДатаИсправляемогоКорректировочногоДокумента) Тогда
			
			ПредставлениеОснования = СтрШаблон(НСтр("ru = '%1 от %2'"),
				Объект.НомерИсправляемогоКорректировочногоДокумента,
				Формат(Объект.ДатаИсправляемогоКорректировочногоДокумента, "ДЛФ=D"));
			
		ИначеЕсли ЗначениеЗаполнено(Объект.НомерИсходногоДокумента)
			И ЗначениеЗаполнено(Объект.ДатаИсходногоДокумента) Тогда
			
			Если ЗначениеЗаполнено(Объект.НомерИсправленияИсходногоДокумента)
				И ЗначениеЗаполнено(Объект.ДатаИсправленияИсходногоДокумента) Тогда
				
				ПредставлениеОснования = СтрШаблон(НСтр("ru = '%1 (испр. %2) от %3'"),
					Объект.НомерИсходногоДокумента,
					Объект.НомерИсправленияИсходногоДокумента,
					Формат(Объект.ДатаИсправленияИсходногоДокумента, "ДЛФ=D"));
				
			Иначе
				
				ПредставлениеОснования = СтрШаблон(НСтр("ru = '%1 от %2'"),
					Объект.НомерИсходногоДокумента,
					Формат(Объект.ДатаИсходногоДокумента, "ДЛФ=D"));
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДокументОснованиеПредставление = Новый ФорматированнаяСтрока(
			ПредставлениеОснования + " " + НСтр("ru='<Отсутствует>'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолейДоКорректировки();
	
	ВидимостьДоКорректировки = Объект.ВидОперации = Перечисления.ВидыОпераций.Корректировка
		ИЛИ (ЗначениеЗаполнено(Объект.НомерИсправляемогоКорректировочногоДокумента)
			И ЗначениеЗаполнено(Объект.ДатаИсправляемогоКорректировочногоДокумента));
	
	Элементы.ТоварыГруппаЗаголовкиСтрок.Видимость       = ВидимостьДоКорректировки;
	Элементы.ТоварыКоличествоДоКорректировки.Видимость  = ВидимостьДоКорректировки;
	Элементы.ТоварыЦенаДоКорректировки.Видимость        = ВидимостьДоКорректировки;
	Элементы.ТоварыСуммаДоКорректировки.Видимость       = ВидимостьДоКорректировки;
	Элементы.ТоварыСуммаНДСДоКорректировки.Видимость    = ВидимостьДоКорректировки;
	Элементы.ТоварыСуммаСНДСДоКорректировки.Видимость   = ВидимостьДоКорректировки;
	Элементы.ТоварыСуммаАкцизаДоКорректировки.Видимость = ВидимостьДоКорректировки;
	
	Если ВидимостьДоКорректировки Тогда
		Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
			ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы)
	
	СтрокаТаблицы.НадписьДоКорректировки    = НСтр("ru = 'До корректировки:'");
	СтрокаТаблицы.НадписьПослеКорректировки = НСтр("ru = 'После корректировки:'");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолейНДС()
	
	ВидимостьНДС = НЕ Объект.ОблагаетсяНДСУПокупателя;
	Элементы.ТоварыСтавкаНДС.Видимость = ВидимостьНДС;
	Элементы.ТоварыГруппаСуммаНДС.Видимость  = ВидимостьНДС;
	Элементы.ТоварыГруппаСуммаСНДС.Видимость = ВидимостьНДС;
	Элементы.ИтогиВсегоНДС.Видимость = ВидимостьНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитовОбъектаПослеВопроса(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьВозможностьРедактированияРеквизитов(ЭтотОбъект);
		Элементы.РазрешитьРедактированиеРеквизитовОбъекта.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВозможностьРедактированияРеквизитов(Форма, Значение = Истина)
	
	Заблокировать = НЕ Значение;
	
	Элементы = Форма.Элементы;
	
	Элементы.Контрагент.ТолькоПросмотр = Заблокировать;
	Элементы.Организация.ТолькоПросмотр = Заблокировать;
	
	Элементы.Грузоотправитель.ТолькоПросмотр = Заблокировать;
	Элементы.Грузополучатель.ТолькоПросмотр = Заблокировать;
	Элементы.Перевозчик.ТолькоПросмотр = Заблокировать;
	Элементы.НомерТранспортнойНакладной.ТолькоПросмотр = Заблокировать;
	Элементы.ДатаТранспортнойНакладной.ТолькоПросмотр = Заблокировать;
	Элементы.СведенияОТранспортировкеИГрузе.ТолькоПросмотр = Заблокировать;
	
	Элементы.ДоговорКонтрагента.ТолькоПросмотр = Заблокировать;
	Элементы.БанковскийСчетКонтрагента.ТолькоПросмотр = Заблокировать;
	Элементы.ИдентификаторГосКонтракта.ТолькоПросмотр = Заблокировать;
	Элементы.НомерИсходногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.ДатаИсходногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.НомерИсправленияИсходногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.ДатаИсправленияИсходногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.НомерИсправляемогоКорректировочногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.ДатаИсправляемогоКорректировочногоДокумента.ТолькоПросмотр = Заблокировать;
	Элементы.ОблагаетсяНДСУПокупателя.ТолькоПросмотр = Заблокировать;
	
	Элементы.ТоварыНоменклатураПоставщика.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыЕдиницаИзмерения.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыКоличествоДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыКоличество.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыЦенаДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыЦена.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСумма.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСтавкаНДС.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаНДСДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаНДС.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаСНДСДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаСНДС.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаАкцизаДоКорректировки.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСуммаАкциза.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыНомерГТД.ТолькоПросмотр = Заблокировать;
	Элементы.ТоварыСтранаПроисхождения.ТолькоПросмотр = Заблокировать;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

&НаКлиенте
Процедура Подключаемый_ПоказатьПредложениеИспользоватьПроверкуКонтрагентов()
	ПроверкаКонтрагентовКлиент.ПредложитьВключитьПроверкуКонтрагентов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов()
	ПроверкаКонтрагентовКлиент.ОбработатьРезультатПроверкиКонтрагентовВДокументе(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОтобразитьРезультатПроверкиКонтрагента() Экспорт
	ПроверкаКонтрагентов.ОтобразитьРезультатПроверкиКонтрагентаВДокументе(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПроверитьКонтрагентовФоновоеЗадание(ПараметрыФоновогоЗадания) Экспорт	
	ПроверкаКонтрагентов.ПроверитьКонтрагентовВДокументеФоновоеЗадание(ЭтотОбъект, ПараметрыФоновогоЗадания);
КонецПроцедуры

// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

// ЭлектронноеВзаимодействие.ОбменСКонтрагентами

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

#КонецОбласти
